app/Http/Controllers/User/StripeVirtualController.php

select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
---
    public function cardBuy(Request $request)
    {
        $request->validate([
            'fund_amount' => 'required|numeric|gt:0',
        ]);

        $user = auth()->user();
        $amount = $request->fund_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => ['Wallet not found']]);
        }
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();