app/Http/Controllers/User/StrowalletVirtualController.php

select * from `virtual_card_apis` limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::first();

select * from `strowallet_virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5
---
    public function index()
    {
        $page_title = "Virtual Card";
        $myCards = StrowalletVirtualCard::where('user_id',auth()->user()->id)->get();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(5)->get();

select * from `strowallet_virtual_cards` where `card_id` = '11ac4e7e-8d28-435e-ac03-a91c60f087bf' limit 1
---
    public function cardDetails($card_id){
        $page_title = "Card Details";
        $myCard = StrowalletVirtualCard::where('card_id',$card_id)->first();
        if(!$myCard) return back()->with(['error' => ['Card Not Found!']]);

select * from `basic_settings` limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
---
    public function cardBuy(Request $request){
        $user = auth()->user();
        if($user->strowallet_customer == null){
            $request->validate([
                'card_amount'       => 'required|numeric|gt:0',
                'first_name'        => 'required|string',
                'last_name'         => 'required|string',
                'house_number'      => 'required|string',
                'id_number'         => 'required|string',
                'customer_email'    => 'required|string',
                'phone'             => 'required|string',
                'date_of_birth'     => 'required|string',
                'line1'             => 'required|string',
                'state'             => 'required|string',
                'zip_code'          => 'required|string',
                'city'              => 'required|string',
                'country'           => 'required|string',
                'id_type'           => 'required|string',
            ]);
        }else{
            $request->validate([
                'card_amount'       => 'required|numeric|gt:0',
            ]);
        }

        $formData   = $request->all();


        $amount = $request->card_amount;
        $basic_setting = BasicSettings::first();
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => ['Wallet not found']]);
        }
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (2, 1, 2, 3, '2023-11-27 12:37:58')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('CARD-BUY', 1, '{\"title\":\"Buy Card \",\"message\":\"Buy card successful 4519460064766613\",\"image\":\"http:\/\/localhost\/wecard\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-11-27 12:37:58', '2023-11-27 12:37:58')
---
    public function insertBuyCardCharge($fixedCharge,$percent_charge, $total_charge,$user,$id,$masked_card) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Buy Card ",
                'message'       => "Buy card successful ".$masked_card,
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::CARD_BUY,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);

update `user_wallets` set `balance` = 773.8, `user_wallets`.`updated_at` = '2023-11-27 12:37:58' where `id` = 1
---
    public function updateSenderWalletBalance($authWallet,$afterCharge) {
        $authWallet->update([
            'balance'   => $afterCharge,
        ]);

select * from `strowallet_virtual_cards` where `id` = '1' and `is_active` = 1 limit 1
---
    public function cardBlockUnBlock(Request $request) {

        $validator = Validator::make($request->all(),[
            'status'                    => 'required|boolean',
            'data_target'               => 'required|string',
        ]);
        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error,null,400);
        }
        $validated = $validator->safe()->all();
        if($request->status == 1){
            require_once('vendor/autoload.php');
            $card   = StrowalletVirtualCard::where('id',$request->data_target)->where('is_active',1)->first();

select * from `strowallet_virtual_cards` where `id` = '1' and `is_active` = 0 limit 1
---

        }else{
            require_once('vendor/autoload.php');
            $card   = StrowalletVirtualCard::where('id',$request->data_target)->where('is_active',0)->first();