app/Http/Controllers/User/SudoVirtualCardController.php

select * from `sudo_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `sudo_virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 5
---
    public function index()
    {

        $page_title = __("Virtual Card");
        $myCards = SudoVirtualCard::where('user_id',auth()->user()->id)->get();
        $totalCards = SudoVirtualCard::where('user_id',auth()->user()->id)->count();
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $cardReloadCharge = TransactionSetting::where('slug','reload_card')->where('status',1)->first();
        $transactions = Transaction::auth()->virtualCard()->latest()->take(5)->get();

select * from `sudo_virtual_cards` where `card_id` = '65a8ac15c321fe6fd66deb91' limit 1
---
    public function cardDetails($card_id)
    {
        $page_title = __("Card Details");
        $myCard = SudoVirtualCard::where('card_id',$card_id)->first();

select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
---
    public function cardBuy(Request $request)
    {
        $request->validate([
            'card_amount' => 'required|numeric|gt:0',
        ]);
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => [__('Please submit kyc information!')]]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => [__('Please wait before admin approved your kyc information')]]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => [__('Admin rejected your kyc information, Please re-submit again')]]);
            }
        }
        $amount = (float) $request->card_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();

select * from `sudo_virtual_cards` where `user_id` = 1 and `id` = '1' limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'reload_card' and `status` = 1 limit 1
---
    public function cardFundConfirm(Request $request){
        $request->validate([
            'id' => 'required|integer',
            'fund_amount' => 'required|numeric|gt:0',
        ]);
        $user = auth()->user();
        $myCard =  SudoVirtualCard::where('user_id',auth()->user()->id)->where('id',$request->id)->first();
        if(!$myCard){
            return back()->with(['error' => [__("Something is wrong in your card")]]);
        }
        $amount = $request->fund_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        $cardCharge = TransactionSetting::where('slug','reload_card')->where('status',1)->first();

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (6, 1, 2, 3, '2024-02-19 09:45:35')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('CARD-FUND', 1, '{\"title\":\"Card Fund\",\"message\":\"Card fund successful card : 506321******3531 100 USD\",\"image\":\"http:\/\/localhost\/wecard\/public\/backend\/images\/default\/default.webp\"}', '2024-02-19 09:45:35', '2024-02-19 09:45:35')
---
    public function insertFundCardCharge($fixedCharge,$percent_charge, $total_charge,$user,$id,$masked_card,$amount) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>__("Card Fund"),
                'message'       => __("Card fund successful card")." : ".$masked_card.' '.getAmount($amount,2).' '.get_default_currency_code(),
                'image'         => get_image($user->image,'user-profile'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::CARD_FUND,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);

update `user_wallets` set `balance` = 576.9, `user_wallets`.`updated_at` = '2024-02-19 09:45:35' where `id` = 1
---
    public function updateSenderWalletBalance($authWallet,$afterCharge) {
        $authWallet->update([
            'balance'   => $afterCharge,
        ]);