app/Http/Controllers/User/VirtualcardController.php

    public function __construct()
    {
        $cardApi = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

    public function index()
    {
        $page_title     = "Virtual Card";
        $myCards        = VirtualCard::where('user_id',auth()->user()->id)->get();
        $cardCharge     = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
        $transactions   = Transaction::auth()->virtualCard()->latest()->take(10)->get();
---
select * from `virtual_cards` where `user_id` = 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'VIRTUAL-CARD' order by `created_at` desc limit 10

    public function cardBuy(Request $request)
    {
        $request->validate([
            'card_amount' => 'required|numeric|gt:0',
        ]);

        $user = auth()->user();
        $amount = $request->card_amount;
        $wallet = UserWallet::where('user_id',$user->id)->first();
        if(!$wallet){
            return back()->with(['error' => ['Wallet not found']]);
        }
        $cardCharge = TransactionSetting::where('slug','virtual_card')->where('status',1)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'virtual_card' and `status` = 1 limit 1

    public function insertBuyCardCharge($fixedCharge,$percent_charge, $total_charge,$user,$id,$masked_card) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>"Buy Card ",
                'message'       => "Buy card successful ".$masked_card,
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::CARD_BUY,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (2, 1, 2, 3, '2023-11-23 10:10:23')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('CARD-BUY', 1, '{\"title\":\"Buy Card \",\"message\":\"Buy card successful 556338*******1898\",\"image\":\"http:\/\/localhost\/wecard\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-11-23 10:10:23', '2023-11-23 10:10:23')