app/Http/Helpers/helpers.php

function authWalletBalance(){
    $wallet = UserWallet::where('user_id',auth()->user()->id)->first();
---
select * from `user_wallets` where `user_id` = 1 limit 1

function get_user_notifications()
{
    $user = auth()->user();
    $notifications = UserNotification::auth()->latest()->take(4)->get();
---
select * from `user_notifications` where `user_id` = 1 order by `created_at` desc limit 4

function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `code` = 'en' limit 1
select * from `languages` where `status` = 1 limit 1

function virtual_card_system($name)
{
    $method = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

function get_api_languages(){

    $lang = Language::get()->map(function($data,$index){

        if(file_exists(base_path('lang/') . $data->code . '.json') == false) return false;

        $json = json_decode(file_get_contents(base_path('lang/') . $data->code . '.json'),true);
        $lan_key_values = [];
        if($json != null) {
            foreach($json as $lan_key=>$item) {
                $lan_key_original = $lan_key;
                $lan_key = preg_replace('/[^A-Za-z]/i',' ',strtolower($lan_key));
                if(strlen($lan_key) > 30) {
                    // $lan_key = substr($lan_key,0,20);
                    $word_array = explode(" ",$lan_key);
                    $count_char = 0;
                    foreach($word_array as $word_key => $word) {
                        $count_char += strlen($word);
                        if($count_char > 30) {
                            $get_limit_val = array_splice($word_array,0,$word_key);
                            $lan_key = implode(" ",$get_limit_val);
                            $count_char = 0;
                            break;
---
select * from `languages`