app/Http/Helpers/stripeCard.php

select * from `virtual_card_apis` limit 1
---
function createConnectAccount(){
    $method = VirtualCardApi::first();