app/Http/Helpers/sudo-card.php

select * from `virtual_card_apis` limit 1
---
function getSudoCard($card_id){
    $method = VirtualCardApi::first();

select * from `virtual_card_apis` limit 1
---
function sudoFundCard($card_account_number,$amount){
    $method = VirtualCardApi::first();