app/Http/Controllers/Api/User/Auth/LoginController.php

    public function login(Request $request){
        $validator = Validator::make($request->all(), [
            'email' => 'required|max:50',
            'password' => 'required|min:6',
        ]);

        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return ApiHelpers::validation($error);
        }
        $user = User::where('username', trim(strtolower($request->email)))->orWhere('email',$request->email)->first();
---
select * from `users` where `username` = 'user@appdevs.net' or `email` = 'user@appdevs.net' limit 1