app/Http/Controllers/SiteController.php

select * from `basic_settings` limit 1
---
    public function home(){
        $basic_settings = BasicSettings::first();

select * from `blogs` where `id` = '2' and `slug` = 'entrepreneurial-success-with-virtual-credit-card-services' limit 1
---
    public function blogDetails($id,$slug){
        $page_title = "Announcement Details";
        $categories = BlogCategory::active()->latest()->get();
        $blog = Blog::where('id',$id)->where('slug',$slug)->first();