app/Http/Controllers/Admin/LanguageController.php

    public function index()
    {
        $page_title = "Language Manager";
        $languages = Language::paginate(10);
---
select * from `languages` limit 10 offset 0
select count(*) as aggregate from `languages`

    public function info($code) {

        $language = Language::where("code",$code);

        if(!$language->exists()) {
            return back()->with(['error' => ['Sorry! Language not found!']]);
        }

        $file = lang_path($code.".json");
        if(!is_file($file)) {
            return back()->with(['error' => ['Something went wrong! Please try again.']]);
        }

        $data = file_get_contents($file);
        try{
            $key_value = json_decode($data,true);
        }catch(Exception $e) {
            return back()->with(['error' => ['Something went wrong! Please try again.']]);
        }

        $language = $language->first();
---
select exists(select * from `languages` where `code` = 'ar') as `exists`
select * from `languages` where `code` = 'ar' limit 1