app/Http/Controllers/Admin/SetupSectionsController.php

select `code`, `name` from `languages` where not `code` = 'en'
---
    public function languages() {
        $languages = Language::whereNot('code',LanguageConst::NOT_REMOVABLE)->select("code","name")->get()->toArray();